boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      1000
Time taken for tests:   60.001 seconds
Complete requests:      15255
Failed requests:        9520
   (Connect: 0, Receive: 13, Length: 9494, Exceptions: 13)
Total transferred:      12328540 bytes
HTML transferred:       12005924 bytes
Requests per second:    254.25 [#/sec] (mean)
Time per request:       3933.177 [ms] (mean)
Time per request:       3.933 [ms] (mean, across all concurrent requests)
Transfer rate:          200.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1  176 1360.5      4   31613
Processing:     0   30 158.5      7    9201
Waiting:        0   13  76.6      0    3205
Total:          3  206 1390.2     12   32852

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     16
  75%     19
  80%     21
  90%    215
  95%   1029
  98%   2066
  99%   3267
 100%  32852 (longest request)