boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2067 bytes

Concurrency Level:      1000
Time taken for tests:   60.001 seconds
Complete requests:      14372
Failed requests:        991
   (Connect: 0, Receive: 0, Length: 991, Exceptions: 0)
Total transferred:      28409986 bytes
HTML transferred:       27660594 bytes
Requests per second:    239.53 [#/sec] (mean)
Time per request:       4174.849 [ms] (mean)
Time per request:       4.175 [ms] (mean, across all concurrent requests)
Transfer rate:          462.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   39 483.4      2   31540
Processing:     1   10  18.0     10     667
Waiting:        0    6  17.4      6     661
Total:          3   49 484.4     13   31556

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     13
  75%     13
  80%     13
  90%     14
  95%     16
  98%    222
  99%   1030
 100%  31556 (longest request)