boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      1000
Time taken for tests:   60.001 seconds
Complete requests:      24905
Failed requests:        23537
   (Connect: 0, Receive: 9908, Length: 3721, Exceptions: 9908)
Total transferred:      7903929 bytes
HTML transferred:       7695441 bytes
Requests per second:    415.08 [#/sec] (mean)
Time per request:       2409.179 [ms] (mean)
Time per request:       2.409 [ms] (mean, across all concurrent requests)
Transfer rate:          128.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   86 867.4      3   31626
Processing:     0  190 1405.1      5   31608
Waiting:        0    9  83.1      0    6464
Total:          1  276 1649.9      8   32952

Percentage of the requests served within a certain time (ms)
  50%      8
  66%     10
  75%     13
  80%     17
  90%    225
  95%   1031
  98%   3045
  99%   7073
 100%  32952 (longest request)