boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:        
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      1000
Time taken for tests:   60.001 seconds
Complete requests:      13441
Failed requests:        9079
   (Connect: 0, Receive: 30, Length: 9019, Exceptions: 30)
Total transferred:      9463080 bytes
HTML transferred:       9215448 bytes
Requests per second:    224.01 [#/sec] (mean)
Time per request:       4464.059 [ms] (mean)
Time per request:       4.464 [ms] (mean, across all concurrent requests)
Transfer rate:          154.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1  208 1490.2      5   31540
Processing:     1   35 202.8      7   13093
Waiting:        0   13 101.8      0    9227
Total:          3  243 1521.3     13   32183

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     19
  75%     22
  80%     25
  90%    223
  95%   1037
  98%   2280
  99%   6129
 100%  32183 (longest request)