boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      1000
Time taken for tests:   60.001 seconds
Complete requests:      14356
Failed requests:        11767
   (Connect: 0, Receive: 13, Length: 11739, Exceptions: 15)
Total transferred:      5600380 bytes
HTML transferred:       5453828 bytes
Requests per second:    239.26 [#/sec] (mean)
Time per request:       4179.485 [ms] (mean)
Time per request:       4.179 [ms] (mean, across all concurrent requests)
Transfer rate:          91.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1  154 1320.3      5   31531
Processing:     0   28 238.2      6   21313
Waiting:        0    7  67.8      0    3221
Total:          3  183 1356.2     11   32988

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     14
  75%     18
  80%     21
  90%     30
  95%    245
  98%   2057
  99%   3250
 100%  32988 (longest request)