boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      1000
Time taken for tests:   60.000 seconds
Complete requests:      13858
Failed requests:        10024
   (Connect: 0, Receive: 10, Length: 10004, Exceptions: 10)
Total transferred:      8247560 bytes
HTML transferred:       8031736 bytes
Requests per second:    230.97 [#/sec] (mean)
Time per request:       4329.636 [ms] (mean)
Time per request:       4.330 [ms] (mean, across all concurrent requests)
Transfer rate:          134.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1  170 1436.2      5   31624
Processing:     0   26 169.6      6    9248
Waiting:        0    8  47.4      0    1530
Total:          3  195 1457.5     12   31858

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     15
  75%     19
  80%     21
  90%     30
  95%   1018
  98%   2052
  99%   3140
 100%  31858 (longest request)