boards/tiac/magpie_f777ni/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient)


Server Software:
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2067 bytes

Concurrency Level:      1000
Time taken for tests:   60.003 seconds
Complete requests:      11569
Failed requests:        194
   (Connect: 0, Receive: 0, Length: 194, Exceptions: 0)
Total transferred:      24150585 bytes
HTML transferred:       23513529 bytes
Requests per second:    192.81 [#/sec] (mean)
Time per request:       5186.553 [ms] (mean)
Time per request:       5.187 [ms] (mean, across all concurrent requests)
Transfer rate:          393.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   45 572.7      3   31464
Processing:     3   12  14.1     12     617
Waiting:        0    8  12.2      8     609
Total:          5   57 573.8     15   31487

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     15
  75%     16
  80%     16
  90%     17
  95%     19
  98%   1012
  99%   1040
 100%  31487 (longest request)